export let lw1 = {
  numer: "1",
  theme: "Основні типи та оператори мови програмування Java",
  aim: "Ознайомлення з основними типами та операторами в Java. Здобуття навичок у використанні типів та операторів в Java.",
  task: "Створити клас, який складається з виконавчого методу, що виконує обчислення значення функції",
  imgsrc: "https://asdjonok.github.io/OOP-SITE/pages/1/formula.png",
  labcode: `
public class App {
    public static void main(String[] args) {
        int variant = 9212;

        /**
         * c2 = 0 -- o1 = +
         * c3 = 2 -- c = 2
         * c5 = 2 -- o2 = %
         * c7 = 0 -- type of i and j = byte
         */
        
         // type of data "byte" can be number from -128 to 127 (inclusive)
        byte a = 1;
        byte b = 1;
    
        byte n = 1;
        byte m = 2;

        int c = 2;

        float result = 0;

        if (n < a || m < b || (a <= -2 && n >= -2) || (b <= 0 && m >= 0)) {
            System.out.println("There is a problem in input data!");
        } else {
            for (byte i = a; i <= n; i++) {
                for (byte j = b; j <= m; j++) {
                    result += (float)(i % j) / (i + c);
                }
            }
            System.out.println(result);
        }
    }
}`,
commentary: `
В лабораторній роботі було використано bytes як основний тип даних. Задати змінну із цим типом можна числом в районі [-128, 127]. 
Такий малий діапазон може стати в пригоді при роботі із роботою у великих масивах, де збереження пам'яті дійсно необхідне.
Окрім цього, змінна з цим типом може бути використана замість int у випадках, де обмеження допомагають краще зрозуміти код.
Якщо ми знаємо про факт обмеженого невеликого діапазону, то використання в коді цього типу може служити певною формою документування
про змінну.`,
conclusions: `
Таким чином була проведена робота із застосуванням типу byte, досліджене застосування цього типу.
Згадано синтаксис циклів у мові Java, приведення типів та його роль у правильності виконання задачі.`
}